--迭代函数，用于计算技能熟练度
--具体方法：
--根据1级熟练度，升级加速度，级数，重复伤害次数，范围，计算出相应等级熟练度
-- SkillExp(i) = Exp1*a^(i-1)*time*range
function SkillExpFunc(Exp0,a,Level,Time,Range)
	return floor(Exp0*(a^(Level-1))*Time*Range/2)
end

SKILLS={
	--天王枪
	qtwaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,3},{2,3}},
		},
	},
	qtwaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,3},{2,3}},
		},
	},
	qtwaipu_3={ --外普3
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,3},{2,3}},
		},
	},
	--天王锤
	ctwaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,4},{2,4}},
		},
	},
	ctwaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,4},{2,4}},
		},
	},
	ctwaipu_3={ --外普3
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,4},{2,4}},
		},
	},
	--天王刀
	dtwaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
	dtwaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
	dtwaipu_3={ --外普3
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},	
		--少林刀
	dswaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
		addphysicsdamage_p={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,2},{2,2}},
		},
	},
	dswaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
		--少林拳
	qswaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,9},{2,9}},
		},
	},
	qswaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,9},{2,9}},
		},
	},
		--少林棍
	gswaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,2},{2,2}},
		},
	},
		--唐门暴雨
	bywaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,5},{15,75},{16,80},{20,100},{21,110}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
	bywaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,5},{15,75},{16,80},{20,100},{21,110}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
	bywaipu_3={ --外普3
		addphysicsdamage_p={
			{{1,5},{15,75},{16,80},{20,100},{21,110}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
		--唐门飞刀
	fdwaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,5},{15,75},{16,80},{20,100},{21,110}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
	fdwaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,5},{15,75},{16,80},{20,100},{21,110}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
		--唐门飞镖
	fbwaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,5},{15,75},{16,80},{20,100},{21,110}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
	fbwaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,5},{15,75},{16,80},{20,100},{21,110}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
		--刀毒
	ddwaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
	ddwaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
	ddwaipu_3={ --外普3
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
		--掌毒
	zdneidu_1={ --内毒1
		woodskill_v={
			{{1,1},{15,15},{16,17},{20,25},{21,30}},
			{{1,-1},{2,-1}},
			{{1,10},{2,10}}
		},
	}, 
	zdneidu_2={ --内毒2
		woodskill_v={
			{{1,1},{15,15},{16,17},{20,25},{21,30}},
			{{1,-1},{2,-1}},
			{{1,10},{2,10}}
		},
	},
	zdneidu_3={ --内毒3
		woodskill_v={
			{{1,1},{15,15},{16,17},{20,25},{21,30}},
			{{1,-1},{2,-1}},
			{{1,10},{2,10}}
		},
	},
		--剑峨
	jewaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,0},{2,0}},
		},
	},
	jewaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,0},{2,0}},
		},
	},
	jewaipu_3={ --外普3
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,0},{2,0}},
		},
	},
		--气峨
	qeneibing_1={ --内冰1
		waterskill_v={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
	qeneibing_2={ --内冰2
		waterskill_v={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
	qeneibing_3={ --内冰3
		waterskill_v={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
		--刀翠
	dcwaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
	dcwaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
	dcwaipu_3={ --外普3
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,1},{2,1}},
		},
	},
		--内翠
	ncneipu_1={ --内普1
		metalskill_v={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
	ncneipu_2={ --内普2
		metalskill_v={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
	ncneipu_3={ --内普3
		metalskill_v={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
		--棍丐
	ggwaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,2},{2,2}},
		},
	},
	ggwaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,2},{2,2}},
		},
	},
		--龙丐
	lgneihuo_1={ --内火1
		fireskill_v={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}},
		},
	},
	lgneihuo_2={ --内火2
		fireskill_v={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}},
		},
	},
		--战忍
	zrwaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,3},{2,3}},
		},
	},
	zrwaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,3},{2,3}},
		},
	},
	zrwaipu_3={ --外普3
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,3},{2,3}},
		},
	},
		--魔忍
	mrneihuo_1={ --内火1
		fireskill_v={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
	mrneihuo_2={ --内火2
		fireskill_v={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
	mrneihuo_3={ --内火3
		fireskill_v={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
		--剑武
	jwwaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,0},{2,0}},
		},
	},
	jwwaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,0},{2,0}},
		},
	},
	jwwaipu_3={ --外普3
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,0},{2,0}},
		},
	},
		--气武
	qwneilei_1={ --内雷1
		earthskill_v={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
	qwneilei_2={ --内雷2
		earthskill_v={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
	qwneilei_3={ --内雷3
		earthskill_v={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
		--刀昆
	dkwaipu_1={ --外普1
		addphysicsdamage_p={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,4},{2,4}},
		},
	},
	dkwaipu_2={ --外普2
		addphysicsdamage_p={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,4},{2,4}},
		},
	},
		--剑昆
	jkneilei_1={ --内雷1
		earthskill_v={
			{{1,10},{15,150},{16,165},{20,225},{21,250}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
	jkneilei_2={ --内雷2
		earthskill_v={
			{{1,20},{15,300},{16,325},{20,425},{21,460}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
	jkneilei_3={ --内雷3
		earthskill_v={
			{{1,30},{15,450},{16,485},{20,625},{21,670}},
			{{1,-1},{2,-1}},
			{{1,-1},{2,-1}}
		},
	},
}

-----------------------------------------------
--Create by yfeng 2004-05-20
-----------------------------------------------

-----------------------------------------------
--根据2个点，求线形函数f(x)=k*x+b
--y= (y2-y1)*(x-x1)/(x2-x1)+y1
--当x2=x1, 有x=c,该直线是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：
function Line(x,x1,y1,x2,y2)
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--根据2个点，求2次形函数f(x)=a*x2+c
--y= (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
--当x1或者x2 < 0 ,y =0
--当x2=x1, 有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Conic(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*x*x/(x2*x2-x1*x1)-(y2-y1)*x1*x1/(x2*x2-x1*x1)+y1
end

-----------------------------------------------
--根据2个点，求-2次形函数f(x)=a*sqrt(x2)+c
--y=(y2-y1)*x/(sqrt(x2)-sqrt(x1))+y1-(y2-y1)/((sqrt(x2)-sqrt(x1))
--当x2或者x1<0, y=0,
--当x1=x2,有x=c,是一条垂直于x轴的直线
--这是可以取得y=任意值
--因此，如果已知两点(x1,y1),(x2,y2)可求得过此2点的
--函数为：extrac
function Extrac(x,x1,y1,x2,y2)
	if((x1 < 0) or (x2<0))then
		return 0
	end
	if(x2==x1) then
		return y2
	end
	return (y2-y1)*(x-x1)/(x2-x1)+y1
end

-----------------------------------------------
--描绘连接线:Link(x,points)
--根据points提供的一系列点，用相邻的两个点描绘曲线
--return y值
--x 输入值
--points 点集合
--形如：points是形如{{x1,y1,func=xxx},{x2,y2,func=xxx},...{xn,yn,func=xxx}}的映射
function Link(x,points)
	num = getn(points)
	if(num<2) then
		return -1
	end
	for i=1,num do
		if(points[i][3]==nil) then
			points[i][3]=Line
		end
	end
	if(x < points[1][1]) then
		return points[1][3](x,points[1][1],points[1][2],points[2][1],points[2][2])
	end
	if(x > points[num][1]) then
		return points[num][3](x,points[num-1][1],points[num-1][2],points[num][1],points[num][2])
	end

	c = 2
	for i=2,num do
		if((x >= points[i-1][1]) and (x <= points[i][1])) then
			c = i
			break
		end
	end
	return points[c][3](x,points[c-1][1],points[c-1][2],points[c][1],points[c][2])
end

------------------------------------------------------
--技能设定格式如下：
--SKILLS={
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--		}，
--		。。。。。
--	}，
--	技能名称=	{
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--		}，
--		魔法属性=	{
--			[1]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[2]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--			[3]={{级别,数值，曲线}，{级别，数值，曲线}，。。。。}，
--		}，
--		。。。。。
--	}，
--	。。。。。
--}
--如：
--SKILLS={
--	Sanhuan-taoyue={
--		physicsenhance_p={
--			[1]={{1,50},{20,335}},--魔法属性physicsenhance_p参数1，1级时为35，20级时为335，曲线不填，默认线形
--			[2]={{1,0},{20,0}},
--		},--没有[3]，表示魔法属性physicsenhance_p参数2，默认为任何时候都是0
--		lightingdamage_v={
--			[1]={{1,65},{20,350}},
--			[3]={{1,65},{20,350}},
--		}
--	}
--}
--以上描述技能“三环套月”的魔法属性和数值
-----------------------------------------------------------
--函数GetSkillLevelData(levelname, data, level)
--levelname：魔法属性名称
--data：技能名称
--level：技能等级
--return：当技能名称为data，技能等级为level
--			时的魔法属性levelname所需求的三个参数的具体值
-----------------------------------------------------------
function GetSkillLevelData(levelname, data, level)
	if(data==nil) then
		return ""
	end
	if(data == "") then
		return ""
	end
	if(SKILLS[data]==nil) then
		return ""
	end
	if(SKILLS[data][levelname]==nil) then
		return ""
	end
	if(SKILLS[data][levelname][1]==nil) then
		SKILLS[data][levelname][1]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][2]==nil) then
		SKILLS[data][levelname][2]={{0,0},{20,0}}
	end
	if(SKILLS[data][levelname][3]==nil) then
		SKILLS[data][levelname][3]={{0,0},{20,0}}
	end
	p1=floor(Link(level,SKILLS[data][levelname][1]))
	p2=floor(Link(level,SKILLS[data][levelname][2]))
	p3=floor(Link(level,SKILLS[data][levelname][3]))
	return Param2String(p1,p2,p3)
end;


function Param2String(Param1, Param2, Param3)
	return Param1..","..Param2..","..Param3
end;

