-- Author: kinnox
-- Date: 23/08/2021
-- Lib: Diem phuc sinh toan server
THANH_ARRAY = {
	{1,	"Ph­îng T­êng phñ "	,
		{
			{51104,102592,"Trung t©m",0},
			{52448,104704,"Cöa §«ng",1},
			{50304,100032,"Cöa T©y",2},
			{49376,103264,"Cöa Nam",3},
			{53184,101024,"Cöa B¾c",4}
		}
	},
	{11 ,	"Thµnh §« phñ "	,
		{
			{100608,162336,"Trung t©m",5},
			{101824,165792,"Cöa §«ng",6},
			{97504,159456 ,"Cöa T©y",7},
			{96160,163392 ,"Cöa Nam",8},
			{103840,160896,"Cöa B¾c",9}
		}
	},
	{162 ,	"§¹i Lý phñ "	,
		{
			{50528,100320,"Trung t©m",63},
			{52128,100992,"Cöa B¾c",64}
		}
	},
	{37 ,	"BiÖn Kinh phñ "	,
		{
			{55232,99200 ,"Trung t©m",23},
			{54272,102976,"Cöa §«ng",24},
			{51904,96512 ,"Cöa T©y",25},
			{59392,94912 ,"Cöa  B¾c",26}
		}
	},
	{78 ,	"T­¬ng D­¬ng phñ "	,
		{
			{50464,103616,"Trung t©m",29},
			{50336,107424,"Cöa §«ng",30},
			{47168,101664,"Cöa T©y",32},
			{46528,104640,"Cöa Nam",31},
			{54528,103552,"Cöa B¾c",33}
		}
	},
	{80 ,	"D­¬ng Ch©u phñ "	,
		{
			{56256,96960 ,"Trung t©m",34},
			{54912,103456,"Cöa §«ng",35},
			{53024,96800 ,"Cöa T©y",38},
			{51776,101824,"Cöa Nam",37},
			{59648,97152 ,"Cöa B¾c",36}

		}
	},
	{176 ,	"L©m An phñ ",
		{
			{44640,106176,"Cöa Nam",67},
			{50208,94016 ,"Cöa  T©y",69},
			{53920,105120,"Cöa §«ng",68},
			{50208,94016 ,"Cöa  B¾c",70},

		}
	}
};
--diem phuc sinh thon tran
THON_ARRAY = {
--{20,110656,197888,	"Giang T©n Th«n" ,1 },
--{121,64000,143200,	"Long M«n TrÊn"	 ,1 },
{53,52032,101696 ,	"Ba L¨ng HuyÖn"	 ,19 }
--{54 			 ,	"Nam Nh¹c TrÊn"	 ,17},
--{174 			 ,	"Long TuyÒn Th«n",66},
--{101 			 ,	"§¹o H­¬ng Th«n" ,47},
--{99 			 ,	"VÜnh L¹c TrÊn"	 ,43},
--{100 			 ,	"Chu Tiªn TrÊn"	 ,45},
--{153 			 ,	"Th¹ch Cæ TrÊn"	 ,59},
--{175 			 ,	"T©y S¬n Th«n"	 ,1 },
};
--diem phuc sinh mon phai
MONPHAI_ARRAY = {
{103	,	"ThiÕu L©m ph¸i"		 ,52},
{59		,	"Thiªn V­¬ng bang"		 ,21},
{25		,	"§­êng M«n"				 ,15},
{183	,	"Ngò §éc gi¸o"			 ,71},
{13		,	"Nga My ph¸i"			 ,13},
{154	,	"Thóy Yªn m«n"			 ,61},
{115	,	"C¸i Bang"				 ,53},
{49		,	"Thiªn NhÉn gi¸o"		 ,28},
{81		,	"Vâ §ang ph¸i"			 ,40},
{131	,	"C«n L«n ph¸i"			 ,57},
};
--noi den ban do cac loai
PLACES_ARRAY1 = {
68,			--Kho¶ Lang ®éng
-- 214,		--Phï Dung ®éng
195,		--Sa M¹c Mª Cung
197,		--Ch©n Nói Tr­êng B¹ch
226,		-- Sa M¹c 1
227,		-- Sa M¹c 2
228,		-- Sa M¹c 3
201,		--Tr­êng B¹ch s¬n b¾c
198,		--Tr­êng B¹ch S¬n Nam
224,		--	Phong L¨ng ®é
225,		--	M¹c Cao QuËt
};

RUONG_ARRAY = {
{{1591,3170},{1571,3118},{1658,3156},{1545,3218},{1630,3260}},	--phuong tuong
{{3155,5075},{3185,5180},{3001,5104},{3052,4981},{3236,5028}},	--thanh do
{{1576,3133},{1625,3151}},										--dai ly
{{1722,3081},{1613,3013},{1694,3207},{1853,2955}},				--bien kinh
{{1565,3219},{1576,3342},{1452,3262},{1481,3164},{1686,3235}},	--tuong duong
{{1756,3006},{1661,2985},{1626,3176},{1709,3227},{1856,3032}},	--duong chau
{{1573,2933},{1687,3277},{1391,3312}},							--lam an
};

THUOC_ARRAY = {
{1603,3193},	--phuong tuong
{3140,5133},	--thanh do
{1497,3209},	--dai ly
{1776,3091},	--bien kinh
{1610,3245},	--tuong duong
{1775,3080},	--duong chau
{1616,2978},	--lam an
};

TAPHOA_ARRAY = {
{1561,3205},	--phuong tuong
{3094,5136},	--thanh do
{1537,3203},	--dai ly
{1786,3101},	--bien kinh
{1629,3262},	--tuong duong
{1701,3021},	--duong chau
{1339,3167},	--lam an
};

XAPHU_ARRAY = {
{{1520,3229},{1560,3109},{1645,3274},{1649,3166}},	--phuong tuong
{{3155,5075},{3185,5180},{3001,5104},{3052,4981},{3236,5028}},	--thanh do	-- chua co
{{1576,3133},{1625,3151}},										--dai ly	-- chua co
{{1722,3081},{1613,3013},{1694,3207},{1853,2955}},				--bien kinh	-- chua co
{{1598,3377},{1438,3212},{1693,3233},{1511,3140}},	--tuong duong
{{1825,3063},{1669,2991},{1594,3194},{1723,3206}},	--duong chau
{{1573,2933},{1687,3277},{1391,3312}},							--lam an	-- chua co
};

function CheckMapNoForTHP(nIdMaps)
Tab_IDWorld={
	342,242,44,210,323,324,325,326,327,328,375,376,377,380,341,201,396,397,398,516,518,520,527,535,580,208,221,222,223,337,338,339,464,465,466,467,468,469,470,388,209,841,395,394
}
	for i=1,getn(Tab_IDWorld) do
	 if (nIdMaps == Tab_IDWorld[i]) then
		return 1;
		end;
	end;
	return 0;
end;